results/spring-quarkus-perf-comparison/2025-12-03_01-53-38/wrk-spring4-jvm-1.log
Running 30s test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.74ms   13.23ms 297.80ms   91.40%
    Req/Sec   7106.65   1306.55  7605.00     96.77
  220306 requests in 30.012s, 176.06MB read
Requests/sec: 7340.60
Transfer/sec:   5.87MB
Socket errors: connectionErrors 2151, requestTimeouts 0