results/spring-quarkus-perf-comparison/2025-12-03_01-53-38/wrk-warmup-spring3-native-2.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.61ms   28.81ms 471.86ms   89.47%
    Req/Sec   4427.95    413.65  4664.00     99.17
  535782 requests in 120.028s, 428.24MB read
Requests/sec: 4463.81
Transfer/sec:   3.57MB
Socket errors: connectionErrors 5294, requestTimeouts 0